SearchBrowseService/stressTest.yml
config:
  target: 'http://localhost:3000'
  http:
    # responses have to be sent within 10 seconds or the request will be aborted
    timeout: 10
  phases:
    # warm up phase with the arrival rate of 5 virtual users/second that last for 60 secs. this phase is short and light to allow the app to warm up.
    - duration: 60
      arrivalRate: 5
    # a ramp up phase where we go from 5 to 50 new virtual user arrivals over 120 secs.
    - duration: 120
      arrivalRate: 5
      rampTo: 50
    # the final high load phase with the arrival rate of 50 that lasts for 600 secs.
    - duration: 600
      arrivalRate: 50
  defaults:
    headers:
      # x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
    - get:
        url: "/content/2672816"